// Задание №1. Дайте ответ, что будет в результате выполнения
// данных ниже примеров. С объяснением, почему это так.

// 1. "кот" > "код"       true т > д

// !2. "2" + 2 * "2"        24 сначало умножение потом конкатенация

// 3. undefined == null    true равны только друг другу и никому другому

// 4. undefined != null    false

// 5. null == 0            false

// 6. 2 > "3"              false

//! 7. null - false + true   1   0-0+1

//! 8. 1 / "l"                Nan деление на не-число дает NaN

// 9. "2" * "3"              6   преобразуются в числа

// 10. 4 + 5 + "O"           "90"

// 11. "l" + 4 + 5            "l45"

// 12. "4" - 2                2

// 13. "4" - "4x"             NaN  4x не может быть преобразовано в число 

// 14. “23” == 23             true

// 15. null == false          false

// 16. " -4 "/ 0 + 1          -Infinity

// 17. null + 1                1

// 18. undefined + null        NaN  undefined → NaN, null → 0, NaN + 0 = NaN

// 19. 1 === “1”                false

// 20. “2” > 10                false

// 21. NaN == undefined        false Nan не равен ничему даже самому себе